Documents/упКорректировкаРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упКорректировкаРейса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упЗаявкиКВыполнению</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьупОстаткиДокументовПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упПрерыванияГрузовыхПотоков</xr:Item>
				<xr:Item>AccumulationRegister.упСостояниеПоЗаданиям</xr:Item>
				<xr:Item>AccumulationRegister.упНепереданныеДокументы</xr:Item>
				<xr:Item>InformationRegister.упРасписаниеРаботыТС</xr:Item>
				<xr:Item>InformationRegister.упПланПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упМаршрутПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упСостоянияТранспортныхСредств</xr:Item>
				<xr:Item>InformationRegister.упПеревозчикПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаданийНаПеревозкуГруза</xr:Item>
				<xr:Item>AccumulationRegister.упЗаданияКПланированию</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьСотрудников</xr:Item>
				<xr:Item>AccumulationRegister.упИнкассацияДенежныхСредств</xr:Item>
				<xr:Item>InformationRegister.упРаботыПоРейсу</xr:Item>
				<xr:Item>AccumulationRegister.упОстаткиГрузовыхМест</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеИзмененияСледующейТочки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упСобытиеМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеПропускаТочки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упСобытиеМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОптимизацияМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеЗапросНаОптимизациюМаршрута</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упСобытиеМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Задания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГрузов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упИзмененияРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИзмененияРейсов</Name>
			<Comment>Фиксируется необходимость обновить данные о рейсе на мобильном клиенте</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетсяОбновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упСтатусыРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыРейсов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыРейса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненЧастично</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложенаЧастьРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПеревозчикПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПеревозчикПоРейсу</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПлановыеПараметрыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПлановыеПараметрыРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтдыхаВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемоеКоличествоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеНачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполненияИсходное</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнкассации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/упНепереданныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упНепереданныеДокументы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегламентногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭкземплярДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЭкземплярыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/упКорректировкаРейса/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий	
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упРейс") Тогда
		// Заполнение шапки.
		Рейс = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	сткДанныеВидаПеревозки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Рейс, "ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах, ВидПеревозки.ВидЗоныДляФормированияПредставленияРейса");
	ФормироватьПоГрузовымМестам = Ложь
							Или сткДанныеВидаПеревозки.ВидПеревозкиПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку
							Или сткДанныеВидаПеревозки.ВидПеревозкиПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса;
	
	Статус = Документы.упРейс.ПолучитьСтатус(Ссылка);
	
	Если Статус = Перечисления.упСтатусыРейса.Отменен Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли; 
	
	Если ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками") Тогда
		Если НЕ ФормироватьПоГрузовымМестам Тогда
			
			ИндексРеквизита = ПроверяемыеРеквизиты.Найти("Задания.ГрузовоеМесто");
			Если НЕ ИндексРеквизита = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ИндексРеквизита);		
			КонецЕсли;
			
			ИндексРеквизита = ПроверяемыеРеквизиты.Найти("Задания.КоличествоГрузов");
			Если НЕ ИндексРеквизита = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ИндексРеквизита);		
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	упКорректировкаРейсаОбъект = Неопределено;
	Если НЕ ДополнительныеСвойства.Свойство("КорректировкаРейса", упКорректировкаРейсаОбъект) Тогда
		упКорректировкаРейсаОбъект = Обработки.упКорректировкаРейса.Создать();	
		ИнициализацияКорректировкиМаршрута(упКорректировкаРейсаОбъект);
		ДополнительныеСвойства.Вставить("КорректировкаРейса", упКорректировкаРейсаОбъект);
	КонецЕсли;
	
	Если Не Отказ 
		И ПолучитьФункциональнуюОпцию("упИспользуютсяКонтейнерныеПеревозки")
	Тогда
		ТекстОшибки = "";
		Если упКорректировкаРейсаОбъект.КонтейнерРасформирован(ТекстОшибки)  Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Запрещено изменять проведение документа с грузами-контейнерами, которые были расформированы
			|(Задания: %1.)'"), ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Истина
		И Не Отказ
		И упКорректировкаРейсаОбъект.ЕстьОтложенныеРаботы
		И РежимЗаписи <> РежимЗаписиДокумента.Запись 
	Тогда
		ТекстОшибки = НСтр("ru = 'Запрещено проводить корректировку по рейсу у которого есть отложенные работы'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;	
	
	Если Истина
		И Не Отказ
		И РежимЗаписи <> РежимЗаписиДокумента.Запись 
	Тогда
		
		// Формируется структура Дополнительные свойства и реквизиты объекта, для восстановления
		// плановых параметров, в случае отмены проведения
		Если НЕ ДополнительныеСвойства.Свойство("ФормироватьПоГрузовымМестам") Тогда
			сткДанныеВидаПеревозки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Рейс, "ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах, 
																	    |ВидПеревозки.ВидЗоныДляФормированияПредставленияРейса, 
																	    |ВидПеревозки.СпособУчетаВозвращенныхДокументов,
																	    |ВидПеревозки.ВариантФормированияМаршрута");
			ФормироватьПоГрузовымМестам = Ложь
									Или сткДанныеВидаПеревозки.ВидПеревозкиПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку 
									Или сткДанныеВидаПеревозки.ВидПеревозкиПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса;
			
			ВидЗоныДляФормированияПредставленияРейса = сткДанныеВидаПеревозки.ВидПеревозкиВидЗоныДляФормированияПредставленияРейса; 
			ВариантФормированияМаршрута = сткДанныеВидаПеревозки.ВидПеревозкиВариантФормированияМаршрута; 
		КонецЕсли;
				
		ДополнительныеСвойства.Вставить("СтатусРейсаДоКорректировки", упКорректировкаРейсаОбъект.СтатусРейсаДоКорректировки);
		ДополнительныеСвойства.Вставить("СпособУчетаВозвращенныхДокументов", сткДанныеВидаПеревозки.ВидПеревозкиСпособУчетаВозвращенныхДокументов);
		ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет"));
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			 ДополнительныеСвойства.Вставить("ТЧЗадания", Задания.Выгрузить(,"Задание, ГрузовоеМесто"));
		КонецЕсли;
		
		РеквизитыОбъекта = Новый Структура();
		РеквизитыОбъекта.Вставить("Дата", Дата);
		РеквизитыОбъекта.Вставить("Рейс", Рейс);
		РеквизитыОбъекта.Вставить("ФормироватьПоГрузовымМестам", ФормироватьПоГрузовымМестам);
		РеквизитыОбъекта.Вставить("ВидЗоныДляФормированияПредставленияРейса", ВидЗоныДляФормированияПредставленияРейса);
		РеквизитыОбъекта.Вставить("ВариантФормированияМаршрута", ВариантФормированияМаршрута);
		РеквизитыОбъекта.Вставить("ПлановыеПараметры", Новый Структура());	
		РеквизитыОбъекта.Вставить("ВидТранспортнойУслуги", упКорректировкаРейсаОбъект.ВидТранспортнойУслуги);	
		
		ДополнительныеСвойства.Вставить("РеквизитыОбъекта" , РеквизитыОбъекта);
		
		Если Истина
			И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
			И упКорректировкаРейсаОбъект.СтатусРейсаДоКорректировки = Перечисления.упСтатусыРейса.КВыполнению 
		Тогда	
			ДополнительныеСвойства.Вставить("МаршрутПоРейсу", упКорректировкаРейсаОбъект.МаршрутДоКорректировки.Выгрузить());	
			ДополнительныеСвойства.Вставить("РаботыПоРейсу", упКорректировкаРейсаОбъект.РаботыДоКорректировки.Выгрузить());
			ДополнительныеСвойства.Вставить("Маршрут", ДополнительныеСвойства.МаршрутПоРейсу);	
			ДополнительныеСвойства.Вставить("Работы", ДополнительныеСвойства.РаботыПоРейсу);

		КонецЕсли;	
		
	КонецЕсли;
		
	Если Истина
		И Не Отказ
		И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения
	Тогда	
		сткРеквизиты = Новый Структура();
		упКорректировкаРейсаОбъект.СформироватьТаблицыДвиженийДляКорректировки(ДополнительныеСвойства, Ссылка, сткРеквизиты, Отказ);
		Если НЕ Отказ Тогда
			ДополнительныеСвойства.Вставить("ПлановоеНачалоВыполнения", упКорректировкаРейсаОбъект.ПлановоеНачалоВыполнения);
			ДополнительныеСвойства.Вставить("ПлановоеОкончаниеВыполнения", упКорректировкаРейсаОбъект.ПлановоеОкончаниеВыполнения);
						
			// Заполнить табличную часть документа "Задания".
			мсвСтроки = упКорректировкаРейсаОбъект.Задания.НайтиСтроки(Новый Структура("СтрокаДокумента", Истина));
			Задания.Очистить();
			Для каждого СтрокаЗадания Из мсвСтроки Цикл
				НоваяСтрока = Задания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадания);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	Если Истина
		И Не Отказ 
		И РежимЗаписи <> РежимЗаписиДокумента.Запись
	Тогда
		СтатусРейса = упРаботаСоСтатусами.ПолучитьТекущийСтатус(Рейс);
		ДополнительныеСвойства.Вставить("Статус", СтатусРейса); 
		
		Отказ = упКорректировкаМаршрута.ЗапрещеноРедактироватьМаршрутИлиРаботыРейса(ЭтотОбъект);
		
		Если НЕ Отказ Тогда
			ТекстОшибки = "";
			Если НЕ упРаботаСоСтатусамиКлиентСервер.РазрешеноФормироватьКорректировкуРейса(СтатусРейса, РежимЗаписи)  Тогда
				ТекстОшибки = НСтр(СтрШаблон("ru = 'Запрещено проводить корректировку по рейсу в статусе ""%1""'", СтатусРейса));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ТекстОшибки = "";
			Если упКорректировкаМаршрута.ЗаданияНаПеревозкуБылиИзмененыПослеПроведенияКорректировки(Ссылка, Рейс, Дата) Тогда
				ТекстОшибки = НСтр("ru = 'Запрещено изменять проведение корректировки, потому что существуют задания на перевозку груза, состояние которых было изменено после проведения корректировки'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если Истина
			И НЕ Отказ
			И РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ПолучитьФункциональнуюОпцию("упИспользуетсяУчетПутевыхЛистов") 
			И ДополнительныеСвойства.Свойство("ИзмененоТранспортноеСредство")
			И упКорректировкаРейсаОбъект <> Неопределено
		Тогда
			сткПараметрыПутевогоЛиста = упРейс.ПараметрыПутевогоЛистаПоРейсу(Рейс);
								
			Если Истина
				И ЗначениеЗаполнено(сткПараметрыПутевогоЛиста.ПутевойЛист)
				И сткПараметрыПутевогоЛиста.ТранспортноеСредство <> упКорректировкаРейсаОбъект.ТранспортноеСредство
			Тогда
				ТекстОшибки = НСтр("ru = 'Запрещено изменять транспортное средство, потому что по рейсу уже создан путевой лист для другого транспортного средства.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);	
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РеквизитыОбъекта = ДополнительныеСвойства.РеквизитыОбъекта;
	ФормироватьПоГрузовымМестам = РеквизитыОбъекта.ФормироватьПоГрузовымМестам;
	
	тбзЗадания = ДополнительныеСвойства.Задания;
	
	текТранспортноеСредство = упРейс.ПолучитьЭкипажРейса(Рейс).ТранспортноеСредство;									  
									  
	БлокировкаДанных = Новый БлокировкаДанных;
	
	Если ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент") Тогда
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упИзмененияРейсов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
	КонецЕсли; 
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыРейсов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Документ", Рейс);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПеревозчикПоРейсу");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПлановыеПараметрыРейса");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
	
	Если ПолучитьФункциональнуюОпцию("упИспользуетсяВозвратДокументовПослеИсполненияРейса") Тогда
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упНепереданныеДокументы");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
	КонецЕсли; 
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упЗаданияКПланированию");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тбзЗадания;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Задание", "Задание");
	Если ФормироватьПоГрузовымМестам Тогда
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрузовоеМесто", "ГрузовоеМесто");
	КонецЕсли;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упСостояниеПоЗаданиям");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тбзЗадания;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Задание", "Задание");
	Если ФормироватьПоГрузовымМестам Тогда
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрузовоеМесто", "ГрузовоеМесто");
	КонецЕсли;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПланПоЗаданиям");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тбзЗадания;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Задание", "Задание");
	Если ФормироватьПоГрузовымМестам Тогда
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрузовоеМесто", "ГрузовоеМесто");
	КонецЕсли;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыЗаявокНаПеревозкуГруза");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = упЗаданиеНаПеревозку.ПолучитьЗаявкиПоЗаданиям(тбзЗадания.ВыгрузитьКолонку("Задание"));
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Заявка");
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыЗаданийНаПеревозкуГруза");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тбзЗадания;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Задание");
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упРаботыПоРейсу");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упМаршрутПоРейсу");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
	
	тбзПрерыванияГрузовыхПотоков = Неопределено;
	Если ДополнительныеСвойства.Свойство("ПрерыванияГрузовыхПотоков", тбзПрерыванияГрузовыхПотоков) Тогда
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПрерыванияГрузовыхПотоков");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = тбзПрерыванияГрузовыхПотоков;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаявкаНаПеревозку", "ЗаявкаНаПеревозку");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрузовоеМесто", "ГрузовоеМесто");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(текТранспортноеСредство) Тогда
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упРасписаниеРаботыТС");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", текТранспортноеСредство);
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упЗанятостьТранспорта");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Транспорт", текТранспортноеСредство);
		ЭлементБлокировки.УстановитьЗначение("Документ", Рейс);
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСостоянияТранспортныхСредств");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", текТранспортноеСредство);
	КонецЕсли;
	
	ПримененныеПравилаВключенияКонтрольныхТочек = Неопределено;
	
	Если ДополнительныеСвойства.Свойство("ПримененныеПравилаВключенияКонтрольныхТочек", ПримененныеПравилаВключенияКонтрольныхТочек) Тогда
		Если Истина
			И ТипЗнч(ПримененныеПравилаВключенияКонтрольныхТочек) = Тип("СписокЗначений")
			И ПримененныеПравилаВключенияКонтрольныхТочек.Количество() > 0
		Тогда
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПримененныеПравилаВключенияКонтрольныхТочек");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);	
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
			ТекстОшибки = ОписаниеОшибки();
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,,Отказ);
		ЗаписьЖурналаРегистрации("ОшибкаБлокировки", УровеньЖурналаРегистрации.Ошибка, ,Ссылка, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		Возврат;
	КонецПопытки;
		
	ДатаКВыполнению = Документы.упРейс.ПолучитьДатуПереводаВСтатус(Рейс, Перечисления.упСтатусыРейса.КВыполнению);
	Если Не ЗначениеЗаполнено(ДатаКВыполнению) Или РеквизитыОбъекта.Дата <= ДатаКВыполнению Тогда
		ТекстОшибки = НСтр("ru = 'Дата документа должна быть больше даты перевода рейса к выполнению!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,,Отказ);
		Возврат;
	КонецЕсли;
	РеквизитыОбъекта.Вставить("ДатаДокумента", Дата); // для совместимости с другими документами с вызовом общих процедур формирования движений
	РеквизитыОбъекта.Вставить("ФактическиеПараметры", Новый Структура);    
	РеквизитыОбъекта.Вставить("Маршрут", ДополнительныеСвойства.Маршрут);    
	РеквизитыОбъекта.Вставить("Работы", ДополнительныеСвойства.Работы);    
	РеквизитыОбъекта.Вставить("ТранспортноеСредство", текТранспортноеСредство);    
	РеквизитыОбъекта.Вставить("ПлановыеПараметры", Новый Структура("ПлановоеНачалоВыполнения, ПлановоеОкончаниеВыполнения",ДополнительныеСвойства.ПлановоеНачалоВыполнения,ДополнительныеСвойства.ПлановоеОкончаниеВыполнения));	
	
	ДополнительныеСвойства.Вставить("КонтролироватьЗадания", Ложь); 
	ДополнительныеСвойства.Вставить("РассчитыватьСтатус", 0); 
	ДополнительныеСвойства.Вставить("ЗаданияНаПеревозкуГрузаПоКоторымИзменилсяСтатус", Новый Массив); 
	ДополнительныеСвойства.Вставить("ЗаявкиНаПеревозкуГрузаПоКоторымИзменилсяСтатус", Новый Массив); 
	ДополнительныеСвойства.Вставить("ТЧЗадания", Задания.Выгрузить(,"Задание, ГрузовоеМесто, Тара"));
	
	ДвиженияСтатусыЗаданий = Движения.упСтатусыЗаданийНаПеревозкуГруза;
	ДвиженияСтатусыЗаданий.Очистить();	
	ДвиженияСтатусыЗаданий.Записывать = Истина;
	
	ДвиженияСтатусыЗаявок = Движения.упСтатусыЗаявокНаПеревозкуГруза;
	ДвиженияСтатусыЗаявок.Очистить();	
	ДвиженияСтатусыЗаявок.Записывать = Истина;

	Движения.Записать();
	
	// Формируются движения по заданиям на перевозку.
	упПрохождениеТочки.СформироватьДвиженияПоЗаданиямНаПеревозку(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируются движения по заявкам в случае отмены заданий.
	упКорректировкаМаршрута.СформироватьДвиженияЗаявкиКВыполнению(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируется маршрут.
	упКорректировкаМаршрута.СформироватьДвижениеМаршрутПоРейсу(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируются работы.
	упКорректировкаМаршрута.СформироватьДвижениеРаботыПоРейсу(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируются данные перевозчика рейса.
	упКорректировкаМаршрута.СформироватьДвижениеПеревозчикПоРейсу(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	 	
	// Формируется пакет документов, о которых следует отчитаться после выполнения рейса.
	упПрохождениеТочки.СформироватьДвиженияНепереданныеДокументы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируются движения по состояниям задания.
	упПрохождениеТочки.СформироватьДвиженияСостояниеПоЗаданиям(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируется план по заданиям.
	упКорректировкаМаршрута.СформироватьДвижениеПланПоЗаданиям(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируется факт инкассации денежных средств.
	упПрохождениеТочки.СформироватьДвиженияИнкассацияДенежныхСредств(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируются данные о случаях прерывания грузовых потоков (отмена/разделение).
	упКорректировкаМаршрута.СформироватьДвижениеПрерыванияГрузовыхПотоков(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();
	
	// Устанавливаются статусы заданий.
	ДополнительныеСвойства.Вставить("ОчиститьЗаписиСтатусЗадания", Истина);
	упЗаданиеНаПеревозку.СформироватьДвиженияСтатусыЗаданий(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
	// Устанавливаются статусы рейса.
	ДополнительныеСвойства.Вставить("ДобавитьСтатус", Ложь);
	ДополнительныеСвойства.Вставить("РассчитыватьСтатус", Истина);
	упРейс.СформироватьДвижениеСтатусыРейса(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// При отклонении времени прохождения точки от плана заполняется плановое окончание рейса
	упКорректировкаМаршрута.СформироватьПлановыеПараметрыРейса(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// При прохождении последней точки формируются фактические параметры рейса.
	упРейс.СформироватьФактическиеПараметрыРейса(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// При прохождении первой точки ТС переводится в состояние "В рейсе", последней - свободно.
	упРейс.СформироватьДвижениеСостояниеТС(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
	упКорректировкаМаршрута.СформироватьДвиженияПлановаяЗанятостьТС(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);

	// Устанавливаются статусы заявок.
	ДополнительныеСвойства.Вставить("ОчиститьЗаписиСтатусЗаявки", Истина);
	упУправленияЗаявками.СформироватьДвиженияСтатусыЗаявок(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упЗаданиеНаПеревозку.ПроконтролироватьЗаданияКПланированию(Ссылка, ФормироватьПоГрузовымМестам, Отказ, ДополнительныеСвойства);
	
	// В случае если это последняя точка маршрута, то устанавливается дата окончания рейса в путевом листе.
	упПрохождениеТочки.ЗаполнитьДатуОкончанияПутевогоЛиста(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// При выполнении рейса на мобильном клиенте фиксируем необоходимость обновить данные по рейсу.
	упКорректировкаМаршрута.СформироватьДвиженияИзмененияРейсов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Если изменяется транспортное средство и по рейсу нет путевых листов, то создается новый путевой лист.
	Если ДополнительныеСвойства.Свойство("СоздатьПутевойЛист") Тогда
		упКорректировкаМаршрута.СформироватьПутевойЛистПоРейсуКорректировки(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	КонецЕсли;
	
	// Заполняются использованные правила при добавлении контрольных точек.
	упКорректировкаМаршрута.СформироватьДвиженияПримененныеПравилаВключенияКонтрольныхТочек(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		упКорректировкаМаршрута.СформироватьПлановыеПараметрыРейса(ДополнительныеСвойства, Ссылка, Неопределено, ДополнительныеСвойства.РеквизитыОбъекта, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Процедура - Инициализация.
//
// Параметры:
//  КорректировкаМаршрутаОбъект - Структура - Данные.
//
Процедура ИнициализацияКорректировкиМаршрута(КорректировкаМаршрутаОбъект) Экспорт
	
	ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками = ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками");
	
	КорректировкаМаршрутаОбъект.Рейс 	= Рейс;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		КорректировкаМаршрутаОбъект.Ссылка 	= Ссылка;
		КорректировкаМаршрутаОбъект.ЗаполнитьПериодДатойДвиженийПоМаршруту();
	Иначе
		КорректировкаМаршрутаОбъект.Ссылка 	= Документы.упКорректировкаРейса.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КорректировкаМаршрутаОбъект.Период)  Тогда
		КорректировкаМаршрутаОбъект.Период = Дата;
	КонецЕсли;
	
	сткПараметрыЗаполнения = Новый Структура();
	сткПараметрыЗаполнения.Вставить("ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками", ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками);
	КорректировкаМаршрутаОбъект.Инициализация(сткПараметрыЗаполнения);
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
